# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
s1 = pd.Series(np.random.randint(1, high=5, size=100))
s2 = pd.Series(np.random.randint(1, high=4, size=100))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100))

print(s1, s2, s3)

0     2
1     2
2     3
3     2
4     4
     ..
95    1
96    1
97    2
98    3
99    2
Length: 100, dtype: int64 0     1
1     1
2     3
3     2
4     3
     ..
95    2
96    2
97    3
98    1
99    3
Length: 100, dtype: int64 0     21086
1     21216
2     21598
3     19601
4     17994
      ...
95    28935
96    15673
97    12621
98    25613
99    19712
Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
#side by side merge with axis=1
housemarket= pd.concat((s1,s2,s3),axis=1)
housemarket

    0  1      2
0   2  1  21086
1   2  1  21216
2   3  3  21598
3   2  2  19601
4   4  3  17994
.. .. ..    ...
95  1  2  28935
96  1  2  15673
97  2  3  12621
98  3  1  25613
99  2  3  19712

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [4]:
#inplace by default is false, which will return a copy
housemarket.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
housemarket.head()

   bedrs  bathrs  price_sqr_meter
0      2       1            21086
1      2       1            21216
2      3       3            21598
3      2       2            19601
4      4       3            17994

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [11]:
#stack the rows with concat axis=0, and change the type of series to dataframe
bigcolumn = pd.concat([s1, s2, s3], axis=0)
#Convert Series to DataFrame
bigcolumn= bigcolumn.to_frame()

bigcolumn

        0
0       2
1       2
2       3
3       2
4       4
..    ...
95  28935
96  15673
97  12621
98  25613
99  19712

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [6]:
#yes, as it have duplicated index

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [14]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        2
1        2
2        3
3        2
4        4
..     ...
295  28935
296  15673
297  12621
298  25613
299  19712

[300 rows x 1 columns]